
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВерсияДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказы.СтатусЗаказа КАК СтатусЗаказа
	|ИЗ
	|	Справочник.Заказы КАК Заказы
	|ГДЕ
	|	Заказы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТекущийСтатусЗаказа", ВыборкаДетальныеЗаписи.СтатусЗаказа);	
	
КонецПроцедуры
