
Процедура ПодпискаНаСобытиеПриЗаписиЗаказаПриЗаписи(Источник, Отказ) Экспорт
		
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ТекущийСтатусЗаказа") = Истина Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущийСтатусЗаказа = Источник.ДополнительныеСвойства.ТекущийСтатусЗаказа;
	
	Если ТекущийСтатусЗаказа <> Источник.СтатусЗаказа Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Статус заказа изменен на: " + Источник.СтатусЗаказа;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
